app/controllers/products_controller.rb

INSERT INTO "products" ("image_file_size", "barcode_format", "updated_at", "title", "price", "quantity", "image_content_type", "barcode", "image_updated_at", "created_at", "image_file_name") VALUES(364, NULL, '2010-03-21 02:55:53', '', NULL, NULL, 'image/png', NULL, '2010-03-21 02:55:53', '2010-03-21 02:55:53', 'image.png')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save